## Arithmetic Operators

In [6]:
a = 10
b = 5
# sum
sum = a+b
sum_a= "peter" + "2"
print(sum)
print(sum_a)
# division
division = a*b
division_a = "peter" * 2
print(division)
print(division_a)
# modulus
modulus = a % b
print(modulus)
# floa division
float
print(modulus)

15
peter2
50
peterpeter
0
0

## Comparision operators

In [10]:
a= 30
b =10
# greater than
print (a > b)
# less than
print (a<b)
# equals to
print (a==b)

True
False
False

## Logical operators

In [16]:
# and operator
print (0 and 9)
print (9 and 0)
# or operator
print (0 or 3)
print (3 or  0)

0
0
3
3

# Variable Assignment

In [23]:
a= 5
print (a)
print("jj")

5
jj

## How variables work in Python

In [19]:
a = 7
b = a
a = 3
print (a)
print(b)

3
7

## Data type

In [21]:
a=5
type(a)
b="waina"
print(b)

waina

## Conditional Statements

In [33]:
# if statement
a=3
b=1
if a > b:
 print("greater")
elif a == b:
 print("is same")
else:
    print("less than")

greater

### Problem one: Take a variable x and print "Even" if number is divided by 2 , otherwise print "Odd"

In [45]:
x=3
if x%2==0:
    print("Even")
else:
    print("Odd")

Odd

Problem 2: Take a variable y and print "Grade A" if y is greater than 90 , "Grade B" if y is greater than 60 but less than or equal to 90 and "Grade F" otherwise

In [48]:
y =10
if y > 90 :
    print("Grade A")
elif y > 60:
    print("Grade B")
elif y <=90:
    print("Grade F")

Grade F

In [50]:
if 5 > 10:
    print("fan")
elif 8 !=9:
    print("glass")
else:
    print("Cream")

glass

# Loops in python

In [56]:
for i in range(100):
    print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99

## Problem 1: Print numbers between 10 and 50

In [58]:
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

## Problem 2: odd numbers between 10 and 50

In [59]:
for i in range(11,50,2):
    print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

## problem 3 : print even numbers between 10 and 50

In [60]:
start, end = 10, 50
# iteration
for num in range(start, end + 1):
   # check
   if num % 2 == 0:
      print(num, end = " ")

10 12 14 16 18 20 22 24 26 28 30 32 34 36 38 40 42 44 46 48 50

In [61]:
for i in range (11,15,3):
    print(i)

11
14

In [67]:

for i in range(19):
    print("f")

f
f
f
f
f
f
f
f
f
f
f
f
f
f
f
f
f
f
f

# Functions in Python

## Problem: Create a function that takes two numbers as argument and returns the greater of the two

In [78]:
def compare(x,y):
    if(x>y):
        greater=x
    else:
        greater=y
        
    return greater

In [79]:
compare(3,4)

4

In [85]:

def odd(a):
    if a%2==0:
        print("not odd")
    else:
        print("odd")

In [86]:
odd(9)

odd

In [88]:
def min (a,b):
    if (a>b):
        return b
    elif (a == b):
        return 'The numbers are equal'
    else:
        return a

In [89]:
min (200,400)

200

## Function to convert miles to km

In [95]:
miles=10
def convert(miles):
    # formulae
    return 1.6 * miles

In [96]:
convert(miles)

16.0

# Lists

In [100]:
list=[2,'e',4,4]
list[1]

'e'

In [101]:
list.append(5)
list

[2, 'e', 4, 4, 5]

In [102]:
list.extend([9,0])
list

[2, 'e', 4, 4, 5, 9, 0]

In [115]:
list.append(0)
list

['e', 4, 4, 5, 9, 0]

In [132]:
list2=[3,3,2,'e',4]
list2.remove('e')
del list2[1]
list2

[3, 2, 4]

In [127]:
for i in list2:
    print (i)

3
3
2
e
4

# Dictionaries

In [13]:
## Creating a dictionary
marks={'english':30,'kiswahili':20}

In [14]:
# printing a dictionary
marks

{'english': 30, 'kiswahili': 20}

In [15]:
# adding an one element to a dictionary
marks['maths']=27
marks

{'english': 30, 'kiswahili': 20, 'maths': 27}

In [17]:
# adding more than on element
marks.update({'biology':10,'chemistry':'20'})
marks

{'english': 30, 'kiswahili': 20, 'maths': 27, 'biology': 10, 'chemistry': '20'}

In [20]:
a=dict()
a=[1]

# Pandas

In [22]:
# importing libraries
import pandas as pd
import matplotlib.pyplot as plt

In [54]:
# reading csv file
df=pd.read_csv('data/data.csv')

In [42]:
df.head(10)
# print number of rows
df.shape[0]
## view all columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [56]:
# selecting more than one column
df[['Sex','Age']]
# selecting column by their position
df.iloc[:,:2]
df[df['Age']==25]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
134,135,0,2,"Sobey, Mr. Samuel James Hayden",male,25.0,0,0,C.A. 29178,13.0000,NaN,S
246,247,0,3,"Lindahl, Miss. Agda Thorilda Viktoria",female,25.0,0,0,347071,7.7750,NaN,S
267,268,1,3,"Persson, Mr. Ernst Ulrik",male,25.0,1,0,347083,7.7750,NaN,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0000,NaN,S
343,344,0,2,"Sedgwick, Mr. Charles Frederick Waddington",male,25.0,0,0,244361,13.0000,NaN,S
353,354,0,3,"Arnold-Franchi, Mr. Josef",male,25.0,1,0,349237,17.8000,NaN,S
370,371,1,1,"Harder, Mr. George Achilles",male,25.0,1,0,11765,55.4417,E50,C
442,443,0,3,"Petterson, Mr. Johan Emil",male,25.0,1,0,347076,7.7750,NaN,S
484,485,1,1,"Bishop, Mr. Dickinson H",male,25.0,1,0,11967,91.0792,B49,C
498,499,0,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S
580,581,1,2,"Christy, Miss. Julie Rachel",female,25.0,1,1,237789,30.0000,NaN,S
666,667,0,2,"Butler, Mr. Reginald Fenton",male,25.0,0,0,234686,13.0000,NaN,S
685,686,0,2,"Laroche, Mr. Joseph Philippe Lemercier",male,25.0,1,2,SC/Paris 2123,41.5792,NaN,C
693,694,0,3,"Saad, Mr. Khalil",male,25.0,0,0,2672,7.2250,NaN,C
703,704,0,3,"Gallagher, Mr. Martin",male,25.0,0,0,36864,7.7417,NaN,Q
728,729,0,2,"Bryhl, Mr. Kurt Arnold Gottfrid",male,25.0,1,0,236853,26.0000,NaN,S
729,730,0,3,"Ilmakangas, Miss. Pieta Sofia",female,25.0,1,0,STON/O2. 3101271,7.9250,NaN,S
784,785,0,3,"Ali, Mr. William",male,25.0,0,0,SOTON/O.Q. 3101312,7.0500,NaN,S
785,786,0,3,"Harmer, Mr. Abraham (David Lishin)",male,25.0,0,0,374887,7.2500,NaN,S
794,795,0,3,"Dantcheff, Mr. Ristiu",male,25.0,0,0,349203,7.8958,NaN,S
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S

## Using iloc function

In [69]:
## Accessing third column
df.iloc[:,3]
## Access the last two columns using iloc
df.iloc[:,-2]
## Access the last ten rows and first two clumns of the index dataframe
df.iloc[:10,:2]

   PassengerId  Survived
0            1         0
1            2         1
2            3         1
3            4         1
4            5         0
5            6         0
6            7         0
7            8         0
8            9         1
9           10         1

In [30]:
# reading excel
df1=pd.read_excel('data/data.xlsx')
df1.head()